spec/cassettes/create_subscription_trial_sub_success.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=12&card[exp_year]=30&card[cvc]=222&metadata[country_code]=NL&metadata[vat_registered]=false&metadata[other]=random
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '160'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 23 Sep 2014 09:16:53 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1400'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1411463813,
          "id": "cus_4pUOMQJ9QihZMg",
          "livemode": false,
          "description": null,
          "email": null,
          "delinquent": false,
          "metadata": {
            "country_code": "NL",
            "vat_registered": "false",
            "other": "random"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_4pUOMQJ9QihZMg/subscriptions",
            "data": [],
            "count": 0
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4pUOMQJ9QihZMg/cards",
            "data": [
              {
                "id": "card_14fpPl2nHroS7mLXTAntPXkp",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "0K7oMWAQAFG7TEob",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4pUOMQJ9QihZMg",
                "type": "Visa"
              }
            ],
            "count": 1
          },
          "default_card": "card_14fpPl2nHroS7mLXTAntPXkp"
        }
    http_version: 
  recorded_at: Tue, 23 Sep 2014 09:16:53 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/plans/trial_plan
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 23 Sep 2014 09:16:54 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '278'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "interval": "month",
          "name": "Trial Plan",
          "created": 1406549176,
          "amount": 1499,
          "currency": "usd",
          "id": "trial_plan",
          "object": "plan",
          "livemode": false,
          "interval_count": 1,
          "trial_period_days": 10,
          "metadata": {},
          "statement_description": null
        }
    http_version: 
  recorded_at: Tue, 23 Sep 2014 09:16:54 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/plans/trial_plan
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 23 Sep 2014 09:16:55 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '278'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "interval": "month",
          "name": "Trial Plan",
          "created": 1406549176,
          "amount": 1499,
          "currency": "usd",
          "id": "trial_plan",
          "object": "plan",
          "livemode": false,
          "interval_count": 1,
          "trial_period_days": 10,
          "metadata": {},
          "statement_description": null
        }
    http_version: 
  recorded_at: Tue, 23 Sep 2014 09:16:55 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_4pUOMQJ9QihZMg
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 23 Sep 2014 09:16:56 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1400'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1411463813,
          "id": "cus_4pUOMQJ9QihZMg",
          "livemode": false,
          "description": null,
          "email": null,
          "delinquent": false,
          "metadata": {
            "country_code": "NL",
            "vat_registered": "false",
            "other": "random"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_4pUOMQJ9QihZMg/subscriptions",
            "data": [],
            "count": 0
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4pUOMQJ9QihZMg/cards",
            "data": [
              {
                "id": "card_14fpPl2nHroS7mLXTAntPXkp",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "0K7oMWAQAFG7TEob",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4pUOMQJ9QihZMg",
                "type": "Visa"
              }
            ],
            "count": 1
          },
          "default_card": "card_14fpPl2nHroS7mLXTAntPXkp"
        }
    http_version: 
  recorded_at: Tue, 23 Sep 2014 09:16:56 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_4pUOMQJ9QihZMg/subscriptions
    body:
      encoding: US-ASCII
      string: plan=trial_plan&trial_end=1411464814
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '36'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 23 Sep 2014 09:16:57 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '755'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_4pUOoj5oYaf9Ly",
          "plan": {
            "interval": "month",
            "name": "Trial Plan",
            "created": 1406549176,
            "amount": 1499,
            "currency": "usd",
            "id": "trial_plan",
            "object": "plan",
            "livemode": false,
            "interval_count": 1,
            "trial_period_days": 10,
            "metadata": {},
            "statement_description": null
          },
          "object": "subscription",
          "start": 1411463816,
          "status": "trialing",
          "customer": "cus_4pUOMQJ9QihZMg",
          "cancel_at_period_end": false,
          "current_period_start": 1411463816,
          "current_period_end": 1411464814,
          "ended_at": null,
          "trial_start": 1411463816,
          "trial_end": 1411464814,
          "canceled_at": null,
          "quantity": 1,
          "application_fee_percent": null,
          "discount": null,
          "metadata": {}
        }
    http_version: 
  recorded_at: Tue, 23 Sep 2014 09:16:57 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices?customer=cus_4pUOMQJ9QihZMg&limit=1
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 23 Sep 2014 09:16:57 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2005'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "has_more": false,
          "url": "/v1/invoices",
          "data": [
            {
              "date": 1411463816,
              "id": "in_14fpPo2nHroS7mLXD3i8Pb9n",
              "period_start": 1411463816,
              "period_end": 1411463816,
              "lines": {
                "object": "list",
                "total_count": 1,
                "has_more": false,
                "url": "/v1/invoices/in_14fpPo2nHroS7mLXD3i8Pb9n/lines",
                "data": [
                  {
                    "id": "sub_4pUOoj5oYaf9Ly",
                    "object": "line_item",
                    "type": "subscription",
                    "livemode": false,
                    "amount": 0,
                    "currency": "usd",
                    "proration": false,
                    "period": {
                      "start": 1411463816,
                      "end": 1411464814
                    },
                    "quantity": 1,
                    "plan": {
                      "interval": "month",
                      "name": "Trial Plan",
                      "created": 1406549176,
                      "amount": 1499,
                      "currency": "usd",
                      "id": "trial_plan",
                      "object": "plan",
                      "livemode": false,
                      "interval_count": 1,
                      "trial_period_days": 10,
                      "metadata": {},
                      "statement_description": null
                    },
                    "description": null,
                    "metadata": {}
                  }
                ],
                "count": 1
              },
              "subtotal": 0,
              "total": 0,
              "customer": "cus_4pUOMQJ9QihZMg",
              "object": "invoice",
              "attempted": true,
              "closed": true,
              "forgiven": false,
              "paid": true,
              "livemode": false,
              "attempt_count": 0,
              "amount_due": 0,
              "currency": "usd",
              "starting_balance": 0,
              "ending_balance": 0,
              "next_payment_attempt": null,
              "webhooks_delivered_at": 1411463816,
              "charge": null,
              "discount": null,
              "application_fee": null,
              "subscription": "sub_4pUOoj5oYaf9Ly",
              "metadata": {},
              "statement_description": null,
              "description": null
            }
          ],
          "count": 1
        }
    http_version: 
  recorded_at: Tue, 23 Sep 2014 09:16:57 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoices/in_14fpPo2nHroS7mLXD3i8Pb9n
    body:
      encoding: US-ASCII
      string: metadata[country_code]=NL&metadata[vat_registered]=false&metadata[other]=random
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '79'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 23 Sep 2014 09:16:58 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1715'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1411463816,
          "id": "in_14fpPo2nHroS7mLXD3i8Pb9n",
          "period_start": 1411463816,
          "period_end": 1411463816,
          "lines": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/invoices/in_14fpPo2nHroS7mLXD3i8Pb9n/lines",
            "data": [
              {
                "id": "sub_4pUOoj5oYaf9Ly",
                "object": "line_item",
                "type": "subscription",
                "livemode": false,
                "amount": 0,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1411463816,
                  "end": 1411464814
                },
                "quantity": 1,
                "plan": {
                  "interval": "month",
                  "name": "Trial Plan",
                  "created": 1406549176,
                  "amount": 1499,
                  "currency": "usd",
                  "id": "trial_plan",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": 10,
                  "metadata": {},
                  "statement_description": null
                },
                "description": null,
                "metadata": {}
              }
            ],
            "count": 1
          },
          "subtotal": 0,
          "total": 0,
          "customer": "cus_4pUOMQJ9QihZMg",
          "object": "invoice",
          "attempted": true,
          "closed": true,
          "forgiven": false,
          "paid": true,
          "livemode": false,
          "attempt_count": 0,
          "amount_due": 0,
          "currency": "usd",
          "starting_balance": 0,
          "ending_balance": 0,
          "next_payment_attempt": null,
          "webhooks_delivered_at": 1411463816,
          "charge": null,
          "discount": null,
          "application_fee": null,
          "subscription": "sub_4pUOoj5oYaf9Ly",
          "metadata": {
            "country_code": "NL",
            "vat_registered": "false",
            "other": "random"
          },
          "statement_description": null,
          "description": null
        }
    http_version: 
  recorded_at: Tue, 23 Sep 2014 09:16:58 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices?customer=cus_4pUOMQJ9QihZMg
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 23 Sep 2014 09:16:59 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2103'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "has_more": false,
          "url": "/v1/invoices",
          "data": [
            {
              "date": 1411463816,
              "id": "in_14fpPo2nHroS7mLXD3i8Pb9n",
              "period_start": 1411463816,
              "period_end": 1411463816,
              "lines": {
                "object": "list",
                "total_count": 1,
                "has_more": false,
                "url": "/v1/invoices/in_14fpPo2nHroS7mLXD3i8Pb9n/lines",
                "data": [
                  {
                    "id": "sub_4pUOoj5oYaf9Ly",
                    "object": "line_item",
                    "type": "subscription",
                    "livemode": false,
                    "amount": 0,
                    "currency": "usd",
                    "proration": false,
                    "period": {
                      "start": 1411463816,
                      "end": 1411464814
                    },
                    "quantity": 1,
                    "plan": {
                      "interval": "month",
                      "name": "Trial Plan",
                      "created": 1406549176,
                      "amount": 1499,
                      "currency": "usd",
                      "id": "trial_plan",
                      "object": "plan",
                      "livemode": false,
                      "interval_count": 1,
                      "trial_period_days": 10,
                      "metadata": {},
                      "statement_description": null
                    },
                    "description": null,
                    "metadata": {}
                  }
                ],
                "count": 1
              },
              "subtotal": 0,
              "total": 0,
              "customer": "cus_4pUOMQJ9QihZMg",
              "object": "invoice",
              "attempted": true,
              "closed": true,
              "forgiven": false,
              "paid": true,
              "livemode": false,
              "attempt_count": 0,
              "amount_due": 0,
              "currency": "usd",
              "starting_balance": 0,
              "ending_balance": 0,
              "next_payment_attempt": null,
              "webhooks_delivered_at": 1411463816,
              "charge": null,
              "discount": null,
              "application_fee": null,
              "subscription": "sub_4pUOoj5oYaf9Ly",
              "metadata": {
                "country_code": "NL",
                "vat_registered": "false",
                "other": "random"
              },
              "statement_description": null,
              "description": null
            }
          ],
          "count": 1
        }
    http_version: 
  recorded_at: Tue, 23 Sep 2014 09:16:59 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices/upcoming?customer=cus_4pUOMQJ9QihZMg
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 23 Sep 2014 09:17:00 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1621'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1411464814,
          "period_start": 1411463816,
          "period_end": 1411464814,
          "lines": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/invoices/upcoming/lines?customer=cus_4pUOMQJ9QihZMg",
            "data": [
              {
                "id": "sub_4pUOoj5oYaf9Ly",
                "object": "line_item",
                "type": "subscription",
                "livemode": false,
                "amount": 1499,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1411464814,
                  "end": 1414056814
                },
                "quantity": 1,
                "plan": {
                  "interval": "month",
                  "name": "Trial Plan",
                  "created": 1406549176,
                  "amount": 1499,
                  "currency": "usd",
                  "id": "trial_plan",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": 10,
                  "metadata": {},
                  "statement_description": null
                },
                "description": null,
                "metadata": {}
              }
            ],
            "count": 1
          },
          "subtotal": 1499,
          "total": 1499,
          "customer": "cus_4pUOMQJ9QihZMg",
          "object": "invoice",
          "attempted": false,
          "closed": false,
          "forgiven": false,
          "paid": false,
          "livemode": false,
          "attempt_count": 0,
          "amount_due": 1499,
          "currency": "usd",
          "starting_balance": 0,
          "ending_balance": null,
          "next_payment_attempt": 1411468414,
          "webhooks_delivered_at": null,
          "charge": null,
          "discount": null,
          "application_fee": null,
          "subscription": "sub_4pUOoj5oYaf9Ly",
          "metadata": {},
          "statement_description": null,
          "description": null
        }
    http_version: 
  recorded_at: Tue, 23 Sep 2014 09:17:00 GMT
recorded_with: VCR 2.9.2
